refactor: switch to mermaid render and add detail
